Boolean - bool

The only values are **True** and **False**

In [3]:
True

True

In [4]:
False

False

In [5]:
3 > 2

True

In [6]:
3 < 2

False

In [7]:
3 != 2

True

In [8]:
#3 = 2

SyntaxError: cannot assign to literal here. Maybe you meant '==' instead of '='? (1733006946.py, line 1)

In [9]:
3 == 2

False

Assignment to a variable: =

Comparison operator: ==

In [10]:
num = 3

In [11]:
num == 2

False

In [12]:
num = 2

## Comparison

- Equality ==
- Inequality !=
- less than <
- greater than >
- less than or equal to <=
- greater than or equal to >=
- is
- not

In [13]:
3 == 3.0

True

In [14]:
3 is 3

<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
C:\Users\Lecturer\AppData\Local\Temp\ipykernel_11780\30664588.py:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
  3 is 3

True

In [15]:
3 is 3.0

<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
<>:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
C:\Users\Lecturer\AppData\Local\Temp\ipykernel_11780\344507504.py:1: SyntaxWarning: "is" with 'int' literal. Did you mean "=="?
  3 is 3.0

False

In [16]:
3 == "3"

False

In [17]:
3 >= 3

True

## if

In [22]:
num = 10

In [23]:
if num > 5: # True
    print("Big number") # This will run

Big number

In [24]:
num = 2
if num > 5: # False
    print("Big number") # This is skipped

In [25]:
num = 2
if num > 5: # False
    int("3.0") # This is skipped

In [26]:
num = 10
if num > 5: # False
    int("3.0") # This is skipped

ValueError: invalid literal for int() with base 10: '3.0'

In [27]:
num = 10
if num > 5:
    print("big num")
    print("This is a second line")
    biggerNum = num * 5
    print(f"This is a bigger num: {biggerNum}")
print("This is outside the if statement")

big num
This is a second line
This is a bigger num: 50
This is outside the if statement

In [28]:
num = 2
if num > 5:
    print("big num")
    print("This is a second line")
    biggerNum = num * 5
    print(f"This is a bigger num: {biggerNum}")
print("This is outside the if statement")

This is outside the if statement

In [29]:
num = 10
# will run
if num > 5:
    print("big num")
    print("This is a second line")
    biggerNum = num * 5
    print(f"This is a bigger num: {biggerNum}")
# will not run
else:
    print("small num")
    print("This is an alternative second line")
    smallerNum = num / 5
    print(f"This is a smaller num: {smallerNum}")
print("This is outside the if statement")

big num
This is a second line
This is a bigger num: 50
This is outside the if statement

In [30]:
num = 2
# will not run
if num > 5:
    print("big num")
    print("This is a second line")
    biggerNum = num * 5
    print(f"This is a bigger num: {biggerNum}")
# will run
else:
    print("small num")
    print("This is an alternative second line")
    smallerNum = num / 5
    print(f"This is a smaller num: {smallerNum}")
print("This is outside the if statement")

small num
This is an alternative second line
This is a smaller num: 0.4
This is outside the if statement

In [32]:
# num = "Python"
# # will not run
# if num > 5:
#     print("big num")
#     print("This is a second line")
#     biggerNum = num * 5
#     print(f"This is a bigger num: {biggerNum}")
# # will run
# else:
#     print("small num")
#     print("This is an alternative second line")
#     smallerNum = num / 5
#     print(f"This is a smaller num: {smallerNum}")
# print("This is outside the if statement")

In [33]:
subject = "programming"

if subject == "programming":
    print("Best class!!")
else:
    print("Its still a good class..")

Best class!!

In [34]:
subject = "data visualisation"

if subject == "programming":
    print("Best class!!")
else:
    print("Its still a good class..")

Its still a good class..

In [35]:
subject = "programming"

if subject == "programming":
    print("Best class!!")
elif subject == "data visualisation":
    print("Don't tell David I said that!")
elif subject == "programming":
    print("Python is fun")
else:
    print("The other classes are still good")

Best class!!

In [36]:
subject = "data visualisation"

if subject == "programming":
    print("Best class!!")
elif subject == "data visualisation":
    print("Don't tell David I said that!")
elif subject == "programming":
    print("Python is fun")
else:
    print("The other classes are still good")

Don't tell David I said that!

In [37]:
subject = "machine learning"

if subject == "programming":
    print("Best class!!")
elif subject == "data visualisation":
    print("Don't tell David I said that!")
elif subject == "programming":
    print("Python is fun")
else:
    print("The other classes are still good")

The other classes are still good

In [38]:
subject = "machine learning"

if subject == "programming":
    print("Best class!!")
if subject == "data visualisation":
    print("Don't tell David I said that!")
if subject == "programming":
    print("Python is fun")
else:
    print("The other classes are still good")

The other classes are still good

In [41]:
subject = "programming"

if subject == "programming":
    print("Best class!!")
if subject == "data visualisation":
    print("Don't tell David I said that!")
elif subject == "programming":
    print("Python is fun")
else:
    print("The other classes are still good")

Best class!!
Python is fun

## Libraries

Code that others have written that we can use

In [42]:
import pandas

In [44]:
data = pandas.read_csv("GSAF5.csv", low_memory=False) # comma separated values

In [46]:
type(data)

pandas.core.frame.DataFrame

In [47]:
data.head()

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
0,10 Nov-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Port Noarlunga,Free diving,Bridgette O’Shannessy,F,32,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,05 Nov-2023,2023.0,Unprovoked,USA,Florida,"Juno Beach, Palm Beach County",Swimming,Steven Reinhardt,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,03 Nov-2023,2023.0,Unprovoked,AUSTRALIA,Westerm Australia,Peak Island,Spearfishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,02 Nov-2023,2023.0,Unprovoked,NEW ZEALAND,North Island,Cape Pallister,Free diving,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,Reported 02 Nov-2023,2023.0,Questionable,EGYPT,Southern Red Sea,Fury Shoal,Scuba diving,Gary Virgo,M,66,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [48]:
data["Country"]

0          AUSTRALIA
1                USA
2          AUSTRALIA
3        NEW ZEALAND
4              EGYPT
            ...
38976            NaN
38977            NaN
38978            NaN
38979            NaN
38980            NaN
Name: Country, Length: 38981, dtype: object

In [50]:
data["Country"] == "AUSTRALIA"

0         True
1        False
2         True
3        False
4        False
         ...
38976    False
38977    False
38978    False
38979    False
38980    False
Name: Country, Length: 38981, dtype: bool

In [51]:
data[ data["Country"] == "AUSTRALIA" ]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
0,10 Nov-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Port Noarlunga,Free diving,Bridgette O’Shannessy,F,32,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,03 Nov-2023,2023.0,Unprovoked,AUSTRALIA,Westerm Australia,Peak Island,Spearfishing,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5,31 Oct-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Streaky Bay,Surfing,Todd Gendle,M,55,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
8,21 Oct-2023,2023.0,Watercraft,AUSTRALIA,Western Australia,"Alexander Bay, Esperance",Fishing,Inflatatable dinghy,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
13,01 Oct-2023,2023.0,Unprovoked,AUSTRALIA,South Australia,Beachport,Swimming,Pamela Cook,F,64,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6908,Before 1906,0.0,Unprovoked,AUSTRALIA,NaN,NaN,Fishing,fisherman,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6909,Before 1906,0.0,Unprovoked,AUSTRALIA,NaN,NaN,Fishing,fisherman,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6910,Before 1906,0.0,Unprovoked,AUSTRALIA,New South Wales,,Swimming,Arab boy,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6911,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,Roebuck Bay,Diving,male,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
6912,Before 1903,0.0,Unprovoked,AUSTRALIA,Western Australia,NaN,Pearl diving,Ahmun,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [52]:
data[ data["Country"] == "IRELAND" ]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
553,01-Sep-2018,2018.0,Provoked,IRELAND,County Cork,NaN,Fishing,Robert Malcolmson,M,40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5893,15-Jul-1917,1917.0,Sea Disaster,IRELAND,Off Ireland,82 miles from Fastnet,Ship Mariston torpedoed & sunk,NaN,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

In [53]:
rows = data["Country"] == "IRELAND"
data[rows]

,Date,Year,Type,Country,State,Location,Activity,Name,Sex,Age,...,Unnamed: 245,Unnamed: 246,Unnamed: 247,Unnamed: 248,Unnamed: 249,Unnamed: 250,Unnamed: 251,Unnamed: 252,Unnamed: 253,Unnamed: 254
553,01-Sep-2018,2018.0,Provoked,IRELAND,County Cork,NaN,Fishing,Robert Malcolmson,M,40,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
5893,15-Jul-1917,1917.0,Sea Disaster,IRELAND,Off Ireland,82 miles from Fastnet,Ship Mariston torpedoed & sunk,NaN,M,NaN,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

## Homework

Chapter 3 Q1 and Q3